{"id":4963,"date":"2020-01-21T14:04:04","date_gmt":"2020-01-21T21:04:04","guid":{"rendered":"http:\/\/www.geopointdata.com\/?p=4963"},"modified":"2021-12-16T01:18:12","modified_gmt":"2021-12-16T08:18:12","slug":"how-to-use-real-estate-lead-lists","status":"publish","type":"post","link":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/","title":{"rendered":"How To Use A Real Estate Lead List"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"4963\" class=\"elementor elementor-4963\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-ad8cf51 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"ad8cf51\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-9194b8a\" data-id=\"9194b8a\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-ba36650 elementor-widget elementor-widget-heading\" data-id=\"ba36650\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h2 class=\"elementor-heading-title elementor-size-default\">What Is A Lead List?<\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-f69faf0 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"f69faf0\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-06c6490\" data-id=\"06c6490\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-e31e9c2 elementor-widget elementor-widget-text-editor\" data-id=\"e31e9c2\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p><span style=\"font-weight: 400;\">A real estate lead list is a list of people or homes real estate professionals use for outreach to find home sellers within their target market. These lists come in a few different flavors.<\/span><\/p><p><span style=\"font-weight: 400;\">In short, there are <\/span><b>farmed lists<\/b><span style=\"font-weight: 400;\">, <\/span><b>single indicator lists<\/b><span style=\"font-weight: 400;\"> and <\/span><b>stacked indicator lists<\/b><span style=\"font-weight: 400;\">. <\/span><\/p><p> <\/p><p><b>Farmed lists<\/b><span style=\"font-weight: 400;\"> are typically focused on a property type, purchase price, date range and\/or geographic location where the real estate professional is looking to market to each &amp; every homeowner in the broad geographic or property details. These lists are the least expensive &amp; usually include all purchase &amp; property characteristics. <\/span><\/p><p><b>Individual indicator lists<\/b><span style=\"font-weight: 400;\"> are lists comprised of homeowners\/properties filtered for one criteria. For example, if you had a vacant list, the list would be just that; properties which are vacant whereas stacked indicator lists, as you may have guessed, “stacks” multiple indicators, such as vacant stacked with absentee owners. <\/span><\/p><p><b>Stacked indicator Lists<\/b><span style=\"font-weight: 400;\"> allow real estate investors to create lists comprised of homeowners who check off the boxes on multiple distressed or motivation criteria. Are these lists that much better? Well think about it this way… who do you think would be a more motivated seller? A homeowner who owns a vacant home or a homeowner who owns a vacant home and has a lot of available equity and low credit? I think the answer is pretty clear.<\/span><\/p><p> <\/p><p><span style=\"font-weight: 400;\">Now that we understand what a lead list is we should quickly cover what is all on a lead list. Some only come with a name or an address while others come complete with the homeowner’s name, address, contact information (cell phone numbers, landlines and email) and some go a little further and include homeowner information such as age, income, credit score etc. and property information such as mortgage amount, equity, etc.. <\/span><\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-40afe54 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"40afe54\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-941c319\" data-id=\"941c319\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-9fa43e9 elementor-widget elementor-widget-text-editor\" data-id=\"9fa43e9\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<h3><b>Do you have all the information you need on your list?<\/b><\/h3><p><span style=\"font-weight: 400;\">First step to learning how to use a real estate lead list is to look at the list you currently have and ask yourself a few questions:<\/span><\/p><ol><li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does your list have names, property addresses AND mailing addresses?<\/span><\/li><li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Does your list include contact information?<\/span><\/li><\/ol><p><span style=\"font-weight: 400;\">If your lead list only has the property addresses you will need to find the homeowner’s name and contact information. If it’s an investor owned home, you’re going to need the name, contact information &amp; a mailing address. If your lead list has homeowner names and addresses you will still need to find the homeowner’s contact information. If your list is “turn-key” and comes with all the information you need for outreach then you can start right away.<\/span><\/p><h3><b>Find contact information for your lists<\/b><\/h3><p><span style=\"font-weight: 400;\">Now, if you need to find missing parts of the lead list, names or contact information, you will need to have your list skip traced. If you are not familiar with skip tracing, it is a way to find missing information on a property or homeowner. Skip tracing basically takes the input data &amp; “skips” across existing national files to determine whether or not that record exists in the national database. If the record does exist, it then looks into the database to see if we have ever maintained contact information on that individual from several different regularly updated databases. The best companies will maintain cell phone, landline &amp; email addresses for both renters &amp; homeowners across the US. <\/span><\/p><p><span style=\"font-weight: 400;\">There are several different companies or people who offer skip tracing services. One thing to keep in mind when searching for skip tracing companies to use make sure to look into how they are charging you. Are they charging for “hits” or “searches”? If you do not know what a skip tracing hit rate is &#8211; read <\/span><a href=\"https:\/\/www.geopointdata.com\/are-you-paying-too-much-for-skip-tracing\/\"><span style=\"font-weight: 400;\">Skip Tracing: Hits and Searches &#8211; Defined<\/span><\/a><span style=\"font-weight: 400;\">. If they are charging for searches, it means you will be charged even if the contact information is not found. Typically skip tracing returns 70-90% % of the leads with contact information and the remaining comes back blank.  If they are charging you per search, you pay for leads that come back without contact information. On the other hand, if the company is charging you for hits, you only pay for the lead which comes back with contact information. A great company to look into for skip tracing is Geopoint Data.<\/span><\/p><h3><b>Outreach, outreach, outreach<\/b><\/h3><p><span style=\"font-weight: 400;\">Now your list is complete with contact information, there are a few different ways to outreach with your list.<\/span><\/p><p><b><i>Cold Calling<\/i><\/b> <span style=\"font-weight: 400;\">&#8211;<\/span> <span style=\"font-weight: 400;\">Cold calling is one of the most common forms of outreach when using a lead list. Some real estate investors hire out their cold calling to call centers domestically or internationally while others do their cold calling personally. Cold calling has been around since phones were invented and is the bread and butter of all sales, including real estate. <\/span><\/p><p><b><i>Text Messaging &#8211; <\/i><\/b><span style=\"font-weight: 400;\">Text messaging is a relatively recent marketing <\/span><i><span style=\"font-weight: 400;\">technique<\/span><\/i><span style=\"font-weight: 400;\">. Though text messaging has been around for some time, most companies have refrained from using outbound text messages as their primary means of reaching out to homeowners for the first time. The idea is that you can use relatively inexpensive touches to entice the homeowner to respond to your marketing prior to talking to them on the phone. <\/span><\/p><p><b><i>Direct Mailers<\/i><\/b> <span style=\"font-weight: 400;\">&#8211; Direct mail is a great way to outreach to the homeowners on your lead list. This would involve using the address on the lead list and either mailing your own handwritten letters (highly recommended), or mailing out materials such as pamphlets, postcards or any correspondence to the homeowner in an attempt to start the conversation about selling their home. Direct mailers can also be sent from an outsourced mailhouse so you do not need to mail to your list on your own.<\/span><\/p><p><b><i>Email Campaigns<\/i><\/b><span style=\"font-weight: 400;\"> &#8211; Email campaigns can be useful as an outreach technique. Short, simple and effective but this technique comes with a few potential problems. First off, if you email too many emails in a short period of time you can be flagged as spam and no one will see your emails. Also, if you embed links into your emails the same problem can happen. Emails can be outdated and often people have several emails they use so it can be easier to lose track of new mail. Still this method can be free and is worth the time to set-up. You can use websites like <\/span><a href=\"https:\/\/www.activecampaign.com\/\"><span style=\"font-weight: 400;\">Active Campaign<\/span><\/a><span style=\"font-weight: 400;\"> or<\/span><a href=\"https:\/\/mailshake.com\/\"><span style=\"font-weight: 400;\"> Mailshake<\/span><\/a><span style=\"font-weight: 400;\"> to make your emailing effortless.<\/span><\/p><p><b><i>Door Knocking<\/i><\/b> <span style=\"font-weight: 400;\">&#8211; Door knocking is a great way to stir up new business. Armed with your list of home addresses you can drive or walk to these homes and try to meet the homeowners in person. You know they have a motivation from the filtering on the list you have so this is a great time to start the interpersonal communication with these homeowners to sell their homes.<\/span><\/p><p><b><i>Facebook Ads<\/i><\/b><span style=\"font-weight: 400;\"> &#8211; This form of outreach is not well known but can be extremely effective and even cost efficient. The way your list is utilized on facebook ads is to input the first names, last names, mailing addresses and zip codes into a custom audience list on Facebook so your facebook ad only is sent to the homeowners who are on your list. You can take this a step further by utilizing the look-a-like audience feature on Facebook to find more people who have similar interests as your email list. Facebook ads can take time to get used to and we recommend either investing in educating yourself on Facebook ads or hiring out your Facebook Ad management to get the best results.<\/span><\/p><h3><b>Why use one form of outreach when you can use them ALL?<\/b><\/h3><p><span style=\"font-weight: 400;\">Why stop at one form of outreach? Afterall, being seen\/heard from multiple sources can be a huge value ad. Think of it this way; what would be more effective? A cold call to a homeowner or a cold call to a homeowner who already received a letter in the mail, an email, saw your ad on Facebook and they got a knock on their door? This is the kind of outreach which amplifies results by creating an omnipresence focused on your list. Will this take more time, effort and money? Yes. But by going the extra mile and doing what other real estate professionals are unwilling to do, you stand apart and are more likely to close deals.<\/span><\/p><h3><b>The Money Is In The Follow-Up<\/b><\/h3><p><span style=\"font-weight: 400;\">No matter which outreach method you are using there is one simple thing which can increase your conversions dramatically. Follow up, follow up, follow up. I am sure you have heard about following-up and I am sure you are doing some sort of follow-up but the one rule in follow-up is you can never have too much follow-up. We built a list of follow-up techniques we have used to convert homeowners into homesellers both on the retail side and cash offer side over the past 16 years. If you want to learn our tried and true follow-up strategies read <\/span><span style=\"text-decoration: underline;\"><span style=\"font-weight: 400;\">Real Estate Follow-Up: Proven Methods For Converting Homeowners Into Homesellers<\/span><span style=\"font-weight: 400;\">.<\/span><\/span><\/p><p><span style=\"font-weight: 400;\">In short, if you are using cold calling as your main outreach method, take notes on the call and write a hand letter about the conversation and mail it to the homeowner. Take it a step further by sending an email or even a text right after the call or better yet while you are on the call. If the call went well, send a small gift to their door. If the call went bad, send a small gift to their door or even a postcard with information if they ever want to sell their home in the future. Did they hang up on you? Great! Call them in 3 months to see if they would like to revisit the conversation. Afterall, a lot can happen in 3 months. Are they not interested? Great! Throw them into a 6 month list to contact every 6 months to see if things have changed. Holiday coming up? Great! Use this as an opportunity to say happy holidays from your business and to stay in front of their mind so if they ever want to sell their home you are the person they think about right away.<\/span><\/p><p><span style=\"font-weight: 400;\">There is no such thing as a “bad lead,” the list you are using is filtered for a motivating indicator and no matter what, there is no excuse to give up on a lead. Timing is everything and without follow-up you are only being heard by the homeowner at one point in time, which may not be the time when they need to sell.<\/span><\/p><h3><b>Who do you know?<\/b><\/h3><p><span style=\"font-weight: 400;\">The last thing to do with your list is to make sure you are asking everyone on the list if they know anyone who is looking to sell their home. On your mailers, put a finder fee section to give your lead motivation to connect you with someone they know. On a phone call, good or bad, ask them if they know anyone. It takes a few seconds and could bring you deals for simply asking the homeowners on your list a simple question.<\/span><\/p><h3><b>Where to get the best real estate lead lists?<\/b><\/h3><p><span style=\"font-weight: 400;\">Now you are armed with information on how to use a list, you may wonder where to get the best quality lists. Some real estate investors like to manually pull records from their local municipal court and get those records skip traced. This can be a cost effective method but comes with some hidden expenses. First off, again, skip tracing can cost a decent amount of money especially if you are paying for searches instead of hits. Use Geopoint Data for your skip tracing as they charge for only matches and have some of the best prices and quality in the industry. <\/span><\/p><p><span style=\"font-weight: 400;\">If you are planning on ordering data online, again <\/span><a href=\"https:\/\/geopointdata.com\/ref?=3\"><span style=\"font-weight: 400;\">Geopoint Data<\/span><\/a><span style=\"font-weight: 400;\"> is going to be your best option. They have access to all 9 major databases which means they know the most about the homeowners and properties on your lead list. They provide name, address, cell phone numbers, landlines, emails along with homeowner and property information which will be extremely useful for your outreach. They have custom lists with no indicators, single indicator or stacked indicators so you can create any list your heart desires. Also their data is updated as often as possible so you can have confidence your lead list is accurate and fresh. <\/span><\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-7a5e53f elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"7a5e53f\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-86ccd35\" data-id=\"86ccd35\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-ec8b6e2 elementor-widget elementor-widget-text-editor\" data-id=\"ec8b6e2\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p><span style=\"font-weight: 400;\">You would think <\/span><a href=\"https:\/\/geopointdata.com\/ref?=3\"><span style=\"font-weight: 400;\">Geopoint Data<\/span><\/a><span style=\"font-weight: 400;\"> would charge an arm and a leg for their lead lists but luckily for all of us, their lead lists cost nearly the same as skip tracing. Would you rather pay for an entire, complete list with all the information you need to succeed or pay a similar price for skip tracing a list you already had to purchase or gather on your own?<\/span><\/p><p><b>Use coupon code WA20 for 20% OFF<\/b><span style=\"font-weight: 400;\"> your first order with <\/span><a href=\"https:\/\/geopointdata.com\/ref?=3\"><span style=\"font-weight: 400;\">Geopoint Data<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Not having success with home seller lead lists? Here is a guide to point you in the right direction for building a home seller lead list that works.<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"default","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","spay_email":""},"categories":[47,46,1],"tags":[44,41,39,36,34,35,33],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Use a Real Estate Lead Lists | Geopoint Data<\/title>\n<meta name=\"description\" content=\"A real estate lead lists is a list of people or homes that real estate professionals use for outreach to find home sellers within their target market.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Use a Real Estate Lead Lists | Geopoint Data\" \/>\n<meta property=\"og:description\" content=\"A real estate lead lists is a list of people or homes that real estate professionals use for outreach to find home sellers within their target market.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/\" \/>\n<meta property=\"og:site_name\" content=\"GeopointData.com\" \/>\n<meta property=\"article:published_time\" content=\"2020-01-21T21:04:04+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-16T08:18:12+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Geo Point\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/geopointdata.com\/#website\",\"url\":\"https:\/\/geopointdata.com\/\",\"name\":\"Geopoint Data\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/geopointdata.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/#webpage\",\"url\":\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/\",\"name\":\"How to Use a Real Estate Lead Lists | Geopoint Data\",\"isPartOf\":{\"@id\":\"https:\/\/geopointdata.com\/#website\"},\"datePublished\":\"2020-01-21T21:04:04+00:00\",\"dateModified\":\"2021-12-16T08:18:12+00:00\",\"author\":{\"@id\":\"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43\"},\"description\":\"A real estate lead lists is a list of people or homes that real estate professionals use for outreach to find home sellers within their target market.\",\"breadcrumb\":{\"@id\":\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/geopointdata.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How To Use A Real Estate Lead List\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43\",\"name\":\"Geo Point\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/geopointdata.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g\",\"caption\":\"Geo Point\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Use a Real Estate Lead Lists | Geopoint Data","description":"A real estate lead lists is a list of people or homes that real estate professionals use for outreach to find home sellers within their target market.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/","og_locale":"en_US","og_type":"article","og_title":"How to Use a Real Estate Lead Lists | Geopoint Data","og_description":"A real estate lead lists is a list of people or homes that real estate professionals use for outreach to find home sellers within their target market.","og_url":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/","og_site_name":"GeopointData.com","article_published_time":"2020-01-21T21:04:04+00:00","article_modified_time":"2021-12-16T08:18:12+00:00","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Geo Point","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/geopointdata.com\/#website","url":"https:\/\/geopointdata.com\/","name":"Geopoint Data","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/geopointdata.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/#webpage","url":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/","name":"How to Use a Real Estate Lead Lists | Geopoint Data","isPartOf":{"@id":"https:\/\/geopointdata.com\/#website"},"datePublished":"2020-01-21T21:04:04+00:00","dateModified":"2021-12-16T08:18:12+00:00","author":{"@id":"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43"},"description":"A real estate lead lists is a list of people or homes that real estate professionals use for outreach to find home sellers within their target market.","breadcrumb":{"@id":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/geopointdata.com\/how-to-use-real-estate-lead-lists\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/geopointdata.com\/"},{"@type":"ListItem","position":2,"name":"How To Use A Real Estate Lead List"}]},{"@type":"Person","@id":"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43","name":"Geo Point","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/geopointdata.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g","caption":"Geo Point"}}]}},"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/posts\/4963"}],"collection":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/comments?post=4963"}],"version-history":[{"count":0,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/posts\/4963\/revisions"}],"wp:attachment":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/media?parent=4963"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/categories?post=4963"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/tags?post=4963"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}