{"id":8247,"date":"2020-03-03T14:39:00","date_gmt":"2020-03-03T21:39:00","guid":{"rendered":"http:\/\/www.geopointdata.com\/?p=8247"},"modified":"2021-12-16T01:15:43","modified_gmt":"2021-12-16T08:15:43","slug":"how-to-follow-up-in-real-estate","status":"publish","type":"post","link":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/","title":{"rendered":"How To Follow-Up In Real Estate &#038; Why You NEED To"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"8247\" class=\"elementor elementor-8247\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-ad8cf51 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"ad8cf51\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-9194b8a\" data-id=\"9194b8a\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-ba36650 elementor-widget elementor-widget-heading\" data-id=\"ba36650\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h2 class=\"elementor-heading-title elementor-size-default\">What Is Your Process For Following Up?<\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-f69faf0 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"f69faf0\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-06c6490\" data-id=\"06c6490\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-e31e9c2 elementor-widget elementor-widget-text-editor\" data-id=\"e31e9c2\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p><span style=\"font-weight: 400;\">What if there was one thing which would guaranteed increase your conversions exponentially when done correctly?<\/span><span style=\"font-weight: 400;\"> Would you throw everything you have into this one thing to ensure your business thrives in any environment? <\/span><\/p><p> <\/p><p><b>Follow-up is the most important part of your business <\/b><\/p><p><span style=\"font-weight: 400;\">Take a quick look at your follow-up right now.<\/span><span style=\"font-weight: 400;\"> How does it look? How many points of contact does each lead receive? What type of ad mediums \/ channels are you using to maintain your follow-up? Do you have a system you replicate on every lead or do you change your follow-up constantly trying new strategies, never giving it enough time to actually work?<\/span><\/p><p><span style=\"font-weight: 400;\">Ask yourself, how many leads have you talked to who ended up selling their home to someone else, maybe someone who offered less than what you offered, simply because they followed up more? <\/span><span style=\"font-weight: 400;\">How much money have you knowingly or unknowingly left on the table by not following up like your business depended on it?<\/span><\/p><p><b>The first rule about follow-up is there is never too much follow-up.<\/b><span style=\"font-weight: 400;\"> Let me say that again, the first rule of follow-up is there in NEVER too much follow-up. This is not even a rule&#8230; it is a law as true as gravity.<\/span><\/p><p><span style=\"font-weight: 400;\">This means, if you have reason to believe this homeowner is going to sell their home&#8230; if someone hangs up on you, if someone slams a door on you, if someone yells at you, if someone tells you to never call again, in any situation good or bad what do you do…? Keep on following-up. If they hang up the phone, send a postcard. If they don’t respond, knock on the door. If they slam the door, send a handwritten note. If they don’t respond to the note, rinse &amp; repeat. <\/span><\/p><p><span style=\"font-weight: 400;\">What do you have to lose from following-up?<\/span><span style=\"font-weight: 400;\"> Maybe you are worried about a bad review? Maybe you are worried they will get mad? Maybe you feel like you are nagging them too much. All these things are distractions from the main point, and these feelings are only in your head &#8211; unmanifested. Most Americans that know how to create opportunity can figure out how to be a Realtor or wholesaler. <\/span><\/p><p><b>Want to know who makes it? The people who leave no lead left behind. <\/b><\/p><p><span style=\"font-weight: 400;\">You are not special. There are LOTS of buyers, Realtors, investors, wholesalers, iBuyers, real estate disruptors. If a homeowner wants to sell their home, especially for cash, they will be able to find someone to sell in a google search or a quick skim through the mail drawer. <\/span><\/p><p><span style=\"font-weight: 400;\">Without follow-up, you will be forgotten. This is where follow-up comes in. You have an opportunity… more importantly an obligation, to remind a lead you are here with a home selling solution whenever they are ready to sell, if that ever happens. You are shifting the control of the situation to have the ball in your court instead of relying on a lead to think of your special mailer, voicemail or short conversation on the phone months after the fact when they are looking to sell their home.<\/span><\/p><p><span style=\"font-weight: 400;\">It is your job, as a real estate professional, to stay in the front of the minds of the leads you are contacting so when they want to explore their options, they will come to you because you are familiar<\/span><span style=\"font-weight: 400;\">. You may have been “annoying”, but you were still there. You educated them and by caring enough to check in every month regarding their situation, you, over time, become a trusted asset for the homeowner when they need the value you can bring.<\/span><\/p><p><span style=\"font-weight: 400;\">The problem with follow-up is knowing what strategies to use to effectively stay in front of your leads mind in creative ways to keep the communication fresh.<\/span><\/p><p><span style=\"font-weight: 400;\">Luckily for you, through <\/span><a href=\"https:\/\/www.geopointdata.com\/?ref=3\"><span style=\"font-weight: 400;\">Geopoint Data<\/span><\/a><span style=\"font-weight: 400;\"> lead lists, you receive an immense amount of data associated with a homeowner as well as the property they own. Armed with this information, which includes cell phone numbers, landlines and emails you have more than enough ammunition to have a vast amount of follow-up with your leads.<\/span><\/p><p><span style=\"font-weight: 400;\">So let&#8217;s get into the trenches and create some fun ways to keep your pipeline full by following up with your leads like your business depends on it.<\/span><\/p><p><span style=\"font-weight: 400;\">Follow-up is exactly what it suggests… follow-up. In order to follow-up you have to have an initial outreach. Let’s, for the sake of this article, start with a cold call being the first form of contact with a lead.<\/span><\/p><p><span style=\"font-weight: 400;\">On the cold call, gauge the interest of the lead from no interest, to highly interested. You can do the same thing via a webform or text message. No interest is still on the spectrum of interest and we will still follow-up with these leads.<\/span><\/p><p><span style=\"font-weight: 400;\">Seperate the leads into these different interest buckets so you can follow-up accordingly based on their interest.<\/span><\/p><p><span style=\"font-weight: 400;\">Since you are using <\/span><a href=\"https:\/\/www.geopointdata.com\/?ref=3\"><span style=\"font-weight: 400;\">Geopoint Data<\/span><\/a><span style=\"font-weight: 400;\"> as your lead list partner, we can expect you to have cell phones, landlines and emails for each lead.<\/span><\/p><p><span style=\"font-weight: 400;\">When you are on the phone with them, ask them for their best contact number and confirm their email. <\/span><\/p><p><span style=\"font-weight: 400;\">Send a text to their confirmed number, or the number you called if they do not confirm, with your name and company and tell them to save it in their phone. Boom. First follow-up done and now you are in their phone. Most likely they did not save your number but now when you text them, the message will go into the past text conversation so they know who is texting them based on the message you sent. Consider this putting a door stopper on the lead, making sure the door is always open, even if just slightly cracked, for you to stop by &amp; say hello.<\/span><\/p><p><span style=\"font-weight: 400;\">After the call is done, send them a text thanking them for their time.<\/span><\/p><p><span style=\"font-weight: 400;\">Do this with your entire lead list until you have all your interest buckets sorted with people who were interested, open to another conversation, slightly interested, and not interested so you can follow-up accordingly. <\/span><\/p><p> <\/p><p><b>Follow-up Strategies and Ideas<\/b><\/p><p><span style=\"font-weight: 400;\">Send an email to all the leads thanking them for their time. Send them an email every week to check in. Send them articles on their market. Send them local comps or listings. Send them anything they would see as value. Use all of these as forms of continuing the conversation.<\/span><\/p><p><span style=\"font-weight: 400;\">Give them a call every week or two to check in to see how they are doing.<\/span><span style=\"font-weight: 400;\"> Ask them if they had time to look at some of the things you sent their email. Let them know if they need anything at all to reach out.<\/span><\/p><p><span style=\"font-weight: 400;\">Send a text thanking them for their time after every call. If they do not answer their phone, send them a text saying “sorry I missed you” and to try to set up a time to get them on the phone at a future date. Send these leads a postcard or mailer with your company information on it. Send them a handwritten letter. Send them holiday cards. Maybe even door knock their address to formally introduce yourself to them.<\/span><\/p><p><span style=\"font-weight: 400;\">Give them a call telling them a postcard is on the way or a letter should be in the mail for them to look for. Call them wishing them a happy holiday. Call them wishing them a happy 4th of July. Call them wishing them a happy Spring or April or call them to wish them a happy Tuesday.<\/span><\/p><p> <\/p><p><b>People won’t hate that you’re trying, most appreciate your efforts. <\/b><\/p><p><span style=\"font-weight: 400;\">Friend them on Facebook and like and comment on their posts. Turn on their post notifications so you can see when they post and you can be the first to like it. Look on social media and find their birth date so you can wish them a happy birthday.<\/span><\/p><p><span style=\"font-weight: 400;\">Learn what they like &amp; share something funny or informative on their page. <\/span><\/p><p><span style=\"font-weight: 400;\">Give them a call about the thing you shared on their page or send them a text to check it out because they are going to love it.<\/span><\/p><p><span style=\"font-weight: 400;\">If they tell you to stop following-up, slow down the follow-up on them but make sure to send them an email every couple months or when you do a mail campaign.  Still send them a text on holidays to wish their family well. Stay in the front of their minds. <\/span><b>You want to become synonymous with housing solutions so when the time comes they choose you or maybe even refer someone to you.<\/b><span style=\"font-weight: 400;\"> If they don’t like your offer, make sure you have another offer ready to go. <\/span><\/p><p><span style=\"font-weight: 400;\">If they continue to tell you to stop, keep following up, keep liking their posts, keep sending them mailers, keep wishing them well, keep reminding them you are here to help them if they need it. <\/span><b>They may not want to talk to you right now but maybe they will lose their job next month and really need your services. You need to make sure you are there when their mood shifts. <\/b><\/p><p><span style=\"font-weight: 400;\">If they block your phone number, send them an email. If they block your email, send them a Facebook message. If they block you on Facebook, send them a letter. You always will have mail to fall back on… You know how many times people that were for months or years unwilling to talk to real estate professionals that eventually decided the time was right &amp; remembered the guy that followed up  as their first choice to discuss their options. <\/span><span style=\"font-weight: 400;\">As long as you’re the one in their mind when they are ready to move &#8211; you will be able to deliver your offer. <\/span><\/p><p><span style=\"font-weight: 400;\">As children, we have been trained to avoid follow-up. “Billy, if Johnny doesn’t want to share, leave him alone”. That’s stupid. If you want to play with the toy next, there are a bunch of other kids that want to play with the toy. You HAVE to be there when Johnny is ready to give up that amazing toy!<\/span><\/p><p><span style=\"font-weight: 400;\">We have been trained to consider this stalker type behavior. It’s not. No one actually thinks that… if anything, it’s only in your head. <\/span><\/p><p><span style=\"font-weight: 400;\">Times have changed. You have something a home seller wants, you have all the solutions they need but maybe they are just not ready yet. One day they will think of moving… their bills will be piling up and they need a way out, they will think about that “annoying realtor or wholesaler” and BAM a mailer will hit their doorstep… again. Followed by another email, a text and a random cold call wishing them the best on <\/span><i><span style=\"font-weight: 400;\">National Pancake Day<\/span><\/i><span style=\"font-weight: 400;\">. All proving you are committed and confident in your ability to give them the home solution they need.<\/span><\/p><p><span style=\"font-weight: 400;\">How bad do you want their business? How much would that assignment fee help you? How mad would you be knowing you called them in March, did not follow-up as much as you knew you should have to later find out their home was listed in April by a real estate professional who called them at the “right time”.<\/span><\/p><p> <\/p><p><b>What is the worst thing that can happen from too much follow-up?<\/b><span style=\"font-weight: 400;\"> A complaint? A blocked number? A passive aggressive comment on your comment on their social media? An email being blocked? Some harsh words?<\/span><\/p><p> <\/p><p><b>What is the best thing that can happen from too much follow-up?<\/b><span style=\"font-weight: 400;\"> <\/span><\/p><p><span style=\"font-weight: 400;\">A deal? A referral? A job well done? <\/span><\/p><p><span style=\"font-weight: 400;\">Most people give up after the initial call and barely, if at all, follow-up. This means you can stand out from the crowd by not giving up on your leads.<\/span><\/p><p><span style=\"font-weight: 400;\">If you could see the future and know a deal will go through after following up every month for a year, why wouldn&#8217;t you follow-up? There is no way of knowing a deal will happen as a result of this type of follow-up but I guarantee the odds are higher than if you stop following-up or never start in the first place.<\/span><\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Not having success with home seller lead lists? Here is a guide to point you in the right direction for building a home seller lead list that works.<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"default","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","spay_email":""},"categories":[47,46,1],"tags":[44,41,39,36,34,35,33],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Follow Up in Real Estate | Geopoint Data<\/title>\n<meta name=\"description\" content=\"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it Follow Up in Real Estate!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Follow Up in Real Estate &amp; Why You Need to | Geopoint Data\" \/>\n<meta property=\"og:description\" content=\"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it follow up!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/\" \/>\n<meta property=\"og:site_name\" content=\"GeopointData.com\" \/>\n<meta property=\"article:published_time\" content=\"2020-03-03T21:39:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-16T08:15:43+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How to Follow Up in Real Estate &amp; Why You Need to | Geopoint Data\" \/>\n<meta name=\"twitter:description\" content=\"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it follow up!\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Geo Point\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/geopointdata.com\/#website\",\"url\":\"https:\/\/geopointdata.com\/\",\"name\":\"Geopoint Data\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/geopointdata.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/#webpage\",\"url\":\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/\",\"name\":\"How to Follow Up in Real Estate | Geopoint Data\",\"isPartOf\":{\"@id\":\"https:\/\/geopointdata.com\/#website\"},\"datePublished\":\"2020-03-03T21:39:00+00:00\",\"dateModified\":\"2021-12-16T08:15:43+00:00\",\"author\":{\"@id\":\"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43\"},\"description\":\"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it Follow Up in Real Estate!\",\"breadcrumb\":{\"@id\":\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/geopointdata.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How To Follow-Up In Real Estate &#038; Why You NEED To\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43\",\"name\":\"Geo Point\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/geopointdata.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g\",\"caption\":\"Geo Point\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Follow Up in Real Estate | Geopoint Data","description":"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it Follow Up in Real Estate!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/","og_locale":"en_US","og_type":"article","og_title":"How to Follow Up in Real Estate & Why You Need to | Geopoint Data","og_description":"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it follow up!","og_url":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/","og_site_name":"GeopointData.com","article_published_time":"2020-03-03T21:39:00+00:00","article_modified_time":"2021-12-16T08:15:43+00:00","twitter_card":"summary_large_image","twitter_title":"How to Follow Up in Real Estate & Why You Need to | Geopoint Data","twitter_description":"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it follow up!","twitter_misc":{"Written by":"Geo Point","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/geopointdata.com\/#website","url":"https:\/\/geopointdata.com\/","name":"Geopoint Data","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/geopointdata.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/#webpage","url":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/","name":"How to Follow Up in Real Estate | Geopoint Data","isPartOf":{"@id":"https:\/\/geopointdata.com\/#website"},"datePublished":"2020-03-03T21:39:00+00:00","dateModified":"2021-12-16T08:15:43+00:00","author":{"@id":"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43"},"description":"What if there was one thing which would guarantee an increase in your conversions exponentially when done correctly, we call it Follow Up in Real Estate!","breadcrumb":{"@id":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/geopointdata.com\/how-to-follow-up-in-real-estate\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/geopointdata.com\/"},{"@type":"ListItem","position":2,"name":"How To Follow-Up In Real Estate &#038; Why You NEED To"}]},{"@type":"Person","@id":"https:\/\/geopointdata.com\/#\/schema\/person\/fcfa4c1a55ea106894adfe72b1026d43","name":"Geo Point","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/geopointdata.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/85a47062dfaa327f683ba7f4eae59272?s=96&d=mm&r=g","caption":"Geo Point"}}]}},"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/posts\/8247"}],"collection":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/comments?post=8247"}],"version-history":[{"count":0,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/posts\/8247\/revisions"}],"wp:attachment":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/media?parent=8247"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/categories?post=8247"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/tags?post=8247"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}