{"id":1375,"date":"2019-11-21T18:41:06","date_gmt":"2019-11-21T18:41:06","guid":{"rendered":"http:\/\/www.geopointdata.com\/?page_id=1375"},"modified":"2019-11-21T19:05:24","modified_gmt":"2019-11-21T19:05:24","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/geopointdata.com\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"1375\" class=\"elementor elementor-1375\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-a37f034 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"a37f034\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-0032b62\" data-id=\"0032b62\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-210a5cb elementor-widget elementor-widget-heading\" data-id=\"210a5cb\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h2 class=\"elementor-heading-title elementor-size-default\">Terms and Conditions<\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-4fc443d elementor-widget elementor-widget-text-editor\" data-id=\"4fc443d\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p><span style=\"font-size: 18px; font-weight: 400;\">Welcome to Geopoint Data<\/span><\/p><p><span style=\"font-weight: 400;\">These terms and conditions outline the rules and regulations for the use of Geopoint Data’s Website, and\/or App, and\/or related products or services.  <\/span><\/p><p><span style=\"font-weight: 400;\">By accessing this website we assume you accept these terms and conditions in full. Do not continue to use Geopoint Data’s  website if you do not accept all of the terms and conditions stated on this page.<\/span><\/p><p><span style=\"font-weight: 400;\">The following terminology applies to these Terms and Conditions, Privacy Statement and Disclaimer Notice and any or all Agreements: “Client”, “You” and “Your” refers to you, the person accessing this website and accepting the Company’s terms and conditions. “The Company”, “Ourselves”, “We”, “Our” and “Us”, refers to our Company. “Party”, “Parties”, or “Us”, refers to both the Client and ourselves, or either the Client or ourselves. <\/span><\/p><p><span style=\"font-weight: 400;\">All terms refer to the offer, acceptance and consideration of payment necessary to undertake the process of our assistance to the Client in the most appropriate manner, whether by formal meetings of a fixed duration, or any other means, for the express purpose of meeting the Client’s needs in respect of provision of the Company’s stated services\/products, in accordance with and subject to, prevailing law of . <\/span><\/p><p><span style=\"font-weight: 400;\">Any use of the above terminology or other words in the singular, plural, capitalisation and\/or he\/she or they, are taken as interchangeable and therefore as referring to same.<\/span><\/p><p><b>Refunds<\/b><\/p><p><b>WE DO NOT OFFER ANY REFUNDS FOR DATA PURCHASED AT GEOPOINTDATA.COM<\/b><\/p><p><b>REQUEST AND INDEMNITY AGREEMENT REGARDING DO-NOT-CONTACT AND TCPA COMPLIANCE<\/b><\/p><p><span style=\"font-weight: 400;\">The undersigned (“Consumer”) has requested to receive from Elastik, LLC (“DBA Geopoint Data”), certain data which includes the names and phone numbers of persons who appear on one or more do-not-contact lists maintained by one or more States or other governmental entities and\/or know wireless phone numbers. Geopoint Data has agreed to supply said data in exchange for the execution of this agreement and the related purchase order\/invoice (“Purchase Order”).<\/span><\/p><p><span style=\"font-weight: 400;\">Customer agrees and warrants that all data which Customer receives from Geopoint Data, or any related or subsidiary corporation, shall be used only in strict compliance with all applicable federal, state, and local laws, rules, regulations, and ordinances, including but not limited to those concerning privacy, telephone solicitation, direct marketing and TCPA compliance. <\/span><\/p><p><span style=\"font-weight: 400;\">Customer acknowledges that it is Customers’ sole responsibility to determine the applicability of any such laws, rules, regulations and ordinances and the identity of any registered or listed persons. Customer further warrants that Customer has requested the do-not-contact data based on the fact that, at the time of communicating or attempting to communicate with any person therein listed, Customer will be exempt from the application of all do-not-contact laws, rules, regulations, and ordinances.<\/span><\/p><p><span style=\"font-weight: 400;\">Customer further agrees to indemnify and hold harmless Geopoint Data and all subsidiary and affiliated entities against any and all damages, fines, penalties and assessments finally awarded in any litigation, arbitration or administrative action, along with any settlement payments made in lieu thereof, including all related costs and attorney’s fees arising out of or otherwise related to the breach of this agreement, or any alleged violation of law, rule, regulation or ordinance based in whole or in part on Customer’s use of the data received from Geopoint Data or any related subsidiary corporation.<\/span><\/p><p><span style=\"font-weight: 400;\">This agreement shall be governed by and construed in accordance with the internal laws of the State of Arizona without regard to its conflict of law rules. Customer agrees that any dispute under this agreement or the Terms and Conditions shall be exclusively heard in the state and federal courts located in Phoenix, Maricopa County, Arizona, and further agrees that said courts are a convenient and appropriate forum<\/span><\/p><p><b>Cookies<\/b><\/p><p><span style=\"font-weight: 400;\">We employ the use of cookies. By using Geopoint Data&#8217;s website you consent to the use of cookies in accordance with Geopoint Data’s privacy policy.Most of the modern day interactive web sites use cookies to enable us to retrieve user details for each visit. Cookies are used in some areas of our site to enable the functionality of this area and ease of use for those people visiting. Some of our affiliate \/ advertising partners may also use cookies.<\/span><\/p><p><b>License<\/b><\/p><p><span style=\"font-weight: 400;\">Unless otherwise stated, Geopoint Data and\/or it’s licensors own the intellectual property rights for all material on Geopoint Data. All intellectual property rights are reserved. You may view and\/or print pages from https:\/\/www.geopointdata.com\/ for your own personal use subject to restrictions set in these terms and conditions. <\/span><\/p><p><span style=\"font-weight: 400;\">You must not:<\/span><\/p><p><span style=\"font-weight: 400;\">Republish material from https:\/\/www.geopointdata.com\/<\/span><\/p><p><span style=\"font-weight: 400;\">Sell, rent or sub-license material from https:\/\/www.geopointdata.com\/<\/span><\/p><p><span style=\"font-weight: 400;\">Reproduce, duplicate or copy material from https:\/\/www.geopointdata.com\/<\/span><\/p><p><span style=\"font-weight: 400;\">Redistribute content from Geopoint Data (unless content is specifically made for redistribution).<\/span><\/p><p><b>User Comments<\/b><\/p><p><span style=\"font-weight: 400;\">Certain parts of this website may offer the opportunity for users to post and exchange opinions, information, material and data (&#8216;Comments&#8217;) in areas of the website. Geopoint Data does not screen, edit, publish or review Comments prior to their appearance on the website and Comments do not reflect the views or opinions of Geo Point, its agents or affiliates. Comments reflect the view and opinion of the person who posts such view or opinion. To the extent permitted by applicable laws Geopoint Data shall not be responsible or liable for the Comments or for any loss cost, liability, damages or expenses caused and or suffered as a result of any use of and\/or posting of and\/or appearance of the Comments on this website. Geopont Data reserves the right to monitor all Comments and to remove any Comments which it considers in its absolute discretion to be inappropriate, offensive or otherwise in breach of these Terms and Conditions.<\/span><\/p><p><span style=\"font-weight: 400;\">You warrant and represent that:<\/span><\/p><p><span style=\"font-weight: 400;\">You are entitled to post the Comments on our website and have all necessary licenses and consents to do so; The Comments do not infringe any intellectual property right, including without limitation copyright, patent or trademark, or other proprietary right of any third party; The Comments do not contain any defamatory, libelous, offensive, indecent or otherwise unlawful material or material which is an invasion of privacy The Comments will not be used to solicit or promote business or custom or present commercial activities or unlawful activity.<\/span><\/p><p><span style=\"font-weight: 400;\">You hereby grant to Geopoint Data a non-exclusive royalty-free license to use, reproduce, <\/span><span style=\"font-size: 18px; font-weight: 400;\">edit and authorize others to use, reproduce and edit any of your Comments in any and all forms, formats or media.<\/span><\/p><p><b>Hyperlinking to our Content<\/b><\/p><p><span style=\"font-weight: 400;\">The following organizations may link to our Web site without prior written approval:<\/span><\/p><p><span style=\"font-weight: 400;\">Government agencies; Search engines; News organizations; Online directory distributors when they list us in the directory may link to our Web site in the same manner as they hyperlink to the Web sites of other listed businesses; and Systemwide Accredited Businesses except soliciting non-profit organizations, charity shopping malls, and charity fundraising groups which may not hyperlink to our Web site.<\/span><\/p><p><span style=\"font-weight: 400;\">These organizations may link to our home page, to publications or to other Web site information so long as the link: (a) is not in any way misleading; (b) does not falsely imply sponsorship, endorsement or approval of the linking party and its products or services; and (c) fits within the context of the linking party&#8217;s site.<\/span><\/p><p><span style=\"font-weight: 400;\">We may consider and approve in our sole discretion other link requests from the following types of organizations: commonly-known consumer and\/or business information sources such as Chambers of Commerce, American Automobile Association, AARP and Consumers Union; dot.com community sites; associations or other groups representing charities, including charity giving sites, online directory distributors; internet portals; accounting, law and consulting firms whose primary clients are businesses; and educational institutions and trade associations.<\/span><\/p><p><span style=\"font-weight: 400;\">We will approve link requests from these organizations if we determine that: (a) the link would not reflect unfavorably on us or our accredited businesses (for example, trade associations or other organizations representing inherently suspect types of business, such as work-at-home opportunities, shall not be allowed to link); (b)the organization does not have an unsatisfactory record with us; (c) the benefit to us from the visibility associated with the hyperlink outweighs the absence of ; and (d) where the link is in the context of general resource information or is otherwise consistent with editorial content in a newsletter or similar product furthering the mission of the organization.<\/span><\/p><p><span style=\"font-weight: 400;\">These organizations may link to our home page, to publications or to other Web site information so long as the link: (a) is not in any way misleading; (b) does not falsely imply sponsorship, endorsement or approval of the linking party and it products or services; and (c) fits within the context of the linking party&#8217;s site.<\/span><\/p><p><span style=\"font-weight: 400;\">If you are among the organizations listed in paragraph 2 above and are interested in linking to our website, you must notify us by sending an e-mail to support@geopointdata.com.<\/span><\/p><p><span style=\"font-weight: 400;\">Please include your name, your organization name, contact information (such as a phone number and\/or e-mail address) as well as the URL of your site, a list of any URLs from which you intend to link to our Web site, and a list of the URL(s) on our site to which you would like to link. Allow 2-3 weeks for a response.<\/span><\/p><p><span style=\"font-weight: 400;\">Approved organizations may hyperlink to our Web site as follows:<\/span><\/p><p><span style=\"font-weight: 400;\">By use of our corporate name; or<\/span><\/p><p><span style=\"font-weight: 400;\">By use of the uniform resource locator (Web address) being linked to; or<\/span><\/p><p><span style=\"font-weight: 400;\">By use of any other description of our Web site or material being linked to that makes sense within the <\/span><span style=\"font-weight: 400;\">context and format of content on the linking party&#8217;s site. <\/span><\/p><p><span style=\"font-weight: 400;\">No use of Geopoint Data’s logo or other artwork will be allowed for linking absent a trademark license agreement. <\/span><\/p><p><b>Iframes<\/b><\/p><p><span style=\"font-weight: 400;\">Without prior approval and express written permission, you may not create frames around our Web pages or use other techniques that alter in any way the visual presentation or appearance of our Web site.<\/span><\/p><p><b>Reservation of Rights<\/b><\/p><p><span style=\"font-weight: 400;\">We reserve the right at any time and in its sole discretion to request that you remove all links or any particular link to our Web site. You agree to immediately remove all links to our Web site upon such request. We also reserve the right to amend these terms and conditions and its linking policy at any time. By continuing to link to our Web site, you agree to be bound to and abide by these linking terms and conditions. <\/span><\/p><p><b>Removal of links from our website<\/b><\/p><p><span style=\"font-weight: 400;\">If you find any link on our Web site or any linked web site objectionable for any reason, you may contact us about this. We will consider requests to remove links but will have no obligation to do so or to respond directly to you. Whilst we endeavour to ensure that the information on this website is correct, we do not warrant its completeness or accuracy; nor do we commit to ensuring that the website remains available or that the material on the website is kept up to date.<\/span><\/p><p><b>Content Liability<\/b><\/p><p><span style=\"font-weight: 400;\">We shall have no responsibility or liability for any content appearing on your Web site. You agree to indemnify and defend us against all claims arising out of or based upon your Website. No link(s) may appear on any page on your Web site or within any context containing content or materials that may be interpreted as libelous, obscene or criminal, or which infringes, otherwise violates, or advocates the infringement or other violation of, any third party rights.<\/span><\/p><p><b>Disclaimer<\/b><\/p><p><span style=\"font-weight: 400;\">To the maximum extent permitted by applicable law, we exclude all representations, warranties and conditions relating to our website and the use of this website (including, without limitation, any warranties implied by law in respect of satisfactory quality, fitness for purpose and\/or the use of reasonable care and skill). Nothing in this disclaimer will:<\/span><\/p><p><span style=\"font-weight: 400;\">limit or exclude our or your liability for death or personal injury resulting from negligence;<\/span><\/p><p><span style=\"font-weight: 400;\">limit or exclude our or your liability for fraud or fraudulent misrepresentation;<\/span><\/p><p><span style=\"font-weight: 400;\">limit any of our or your liabilities in any way that is not permitted under applicable law; or <\/span><span style=\"font-weight: 400;\">exclude any of our or your liabilities that may not be excluded under applicable law.<\/span><\/p><p><span style=\"font-weight: 400;\">The limitations and exclusions of liability set out in this Section and elsewhere in this disclaimer: (a) are subject to the preceding paragraph; and (b) govern all liabilities arising under the disclaimer or in relation to the subject matter of this disclaimer, including liabilities arising in contract, in tort (including negligence) and for breach of statutory duty. To the extent that the website and the information and services on the website are provided, we will not be liable for any loss or damage of any nature.<\/span><\/p><p><b>Contact Information<\/b><\/p><p><span style=\"font-weight: 400;\">If you have any queries regarding any of our terms, please contact us.<\/span><\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Terms and Conditions Welcome to Geopoint DataThese terms and conditions outline the rules and regulations for the use of Geopoint Data’s Website, and\/or App, and\/or related products or services.  By accessing this website we assume you accept these terms and conditions in full. Do not continue to use Geopoint Data’s  website if you do not accept &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"https:\/\/geopointdata.com\/terms-conditions\/\"> <span class=\"screen-reader-text\">Terms &#038; Conditions<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"no-sidebar","site-content-layout":"page-builder","ast-global-header-display":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"disabled","ast-breadcrumbs-content":"","ast-featured-img":"disabled","footer-sml-layout":"","theme-transparent-header-meta":"","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","spay_email":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms &amp; Conditions - GeopointData.com<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.thedatafleet.com\/terms-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms &amp; Conditions - GeopointData.com\" \/>\n<meta property=\"og:description\" content=\"Terms and Conditions Welcome to Geopoint DataThese terms and conditions outline the rules and regulations for the use of Geopoint Data’s Website, and\/or App, and\/or related products or services.  By accessing this website we assume you accept these terms and conditions in full. Do not continue to use Geopoint Data’s  website if you do not accept &hellip; Terms &#038; Conditions Read More &raquo;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.thedatafleet.com\/terms-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"GeopointData.com\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-21T19:05:24+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/geopointdata.com\/#website\",\"url\":\"https:\/\/geopointdata.com\/\",\"name\":\"Geopoint Data\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/geopointdata.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.thedatafleet.com\/terms-conditions\/#webpage\",\"url\":\"https:\/\/www.thedatafleet.com\/terms-conditions\/\",\"name\":\"Terms & Conditions - GeopointData.com\",\"isPartOf\":{\"@id\":\"https:\/\/geopointdata.com\/#website\"},\"datePublished\":\"2019-11-21T18:41:06+00:00\",\"dateModified\":\"2019-11-21T19:05:24+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.thedatafleet.com\/terms-conditions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.thedatafleet.com\/terms-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.thedatafleet.com\/terms-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/geopointdata.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms &#038; Conditions\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms & Conditions - GeopointData.com","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.thedatafleet.com\/terms-conditions\/","og_locale":"en_US","og_type":"article","og_title":"Terms & Conditions - GeopointData.com","og_description":"Terms and Conditions Welcome to Geopoint DataThese terms and conditions outline the rules and regulations for the use of Geopoint Data’s Website, and\/or App, and\/or related products or services.  By accessing this website we assume you accept these terms and conditions in full. Do not continue to use Geopoint Data’s  website if you do not accept &hellip; Terms &#038; Conditions Read More &raquo;","og_url":"https:\/\/www.thedatafleet.com\/terms-conditions\/","og_site_name":"GeopointData.com","article_modified_time":"2019-11-21T19:05:24+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/geopointdata.com\/#website","url":"https:\/\/geopointdata.com\/","name":"Geopoint Data","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/geopointdata.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.thedatafleet.com\/terms-conditions\/#webpage","url":"https:\/\/www.thedatafleet.com\/terms-conditions\/","name":"Terms & Conditions - GeopointData.com","isPartOf":{"@id":"https:\/\/geopointdata.com\/#website"},"datePublished":"2019-11-21T18:41:06+00:00","dateModified":"2019-11-21T19:05:24+00:00","breadcrumb":{"@id":"https:\/\/www.thedatafleet.com\/terms-conditions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.thedatafleet.com\/terms-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.thedatafleet.com\/terms-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/geopointdata.com\/"},{"@type":"ListItem","position":2,"name":"Terms &#038; Conditions"}]}]}},"_links":{"self":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/pages\/1375"}],"collection":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/comments?post=1375"}],"version-history":[{"count":0,"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/pages\/1375\/revisions"}],"wp:attachment":[{"href":"https:\/\/geopointdata.com\/wp-json\/wp\/v2\/media?parent=1375"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}